For Pandas assignments, you are going to use [Titanic](https://www.kaggle.com/c/titanic/download/GQf0y8ebHO0C4JXscPPp%2Fversions%2FXkNkvXwqPPVG0Qt3MtQT%2Ffiles%2Ftrain.csv) (train.csv) dataset. Download the dataset and load to a data frame.

**(1)** Calculate the average age of the passengers for each gender and passenger class by using `groupby()` method.

In [2]:
import pandas as pd
import numpy as np
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv", index_col=0)
titanic2 = pd.DataFrame(titanic)
#print(titanic2.groupby(by='sex')['age'].mean()) #avgerage age of each gender
#print(titanic2.groupby(by='class')['age'].mean()) #average age of each class
#print(titanic2.groupby(by=['sex','class'])['age'].mean()) # average age of classes with gender
#Or not seperated them
print(titanic2.groupby(by=['sex','class'])['age'].mean())

sex     class
female  First     34.318841
        Second    28.209091
        Third     24.709677
male    First     39.155556
        Second    31.254583
        Third     26.560484
Name: age, dtype: float64

**(2)** Group by embarkation port and print values. (Notice that you get unique values with this.)

In [3]:
titanic2.groupby(by='embark_town').count() #we calculate the number of passengers with group them in embarkation port.

             sex  age  n_siblings_spouses  parch  fare  class  deck  alone
embark_town
Cherbourg    123  123                 123    123   123    123   123    123
Queenstown    53   53                  53     53    53     53    53     53
Southampton  450  450                 450    450   450    450   450    450
unknown        1    1                   1      1     1      1     1      1